from pymongo import MongoClient
from config import MONGO_URI, DB_NAME
category_keywords = {
    "娛樂購物": {
        "電影", "電影院", "美容", "美髮", "剪頭髮", "染髮", "護髮",
        "數位服務", "訂閱", "遊戲", "手遊", "Steam", "音樂", "唱歌", "KTV", "旅遊", "按摩",
        "服飾", "衣服", "鞋子", "褲子", "外套", "配件", "包包",
        "3c產品", "手機", "電腦", "耳機", "平板", "滑鼠", "鍵盤",
        "美妝保養", "化妝品", "保養品", "面膜", "精品", "名牌", "手錶", "珠寶",
        "夾娃娃", "玩具", "公仔", "模型",
        "網路購物", "蝦皮", "momo", "PChome", "Yahoo拍賣", "團購", "百貨", "購物中心", "超商取貨",
        "攝影", "照相", "影集", "小說", "漫畫", "雜誌", "寵物", "寵物用品"
    },
    "飲食": {
        "早餐", "早午餐", "飯", "米飯", "麵", "拉麵", "牛肉麵", "烏龍麵", "炒飯", "炒麵", "湯麵",
        "午餐", "晚餐", "便當", "快餐", "定食", "燒臘", "簡餐", "自助餐",
        "小吃", "鹹酥雞", "滷味", "炸雞", "燒烤", "火鍋", "牛排", "燒肉", "素食",
        "漢堡", "吐司", "三明治", "蛋餅", "蛋糕", "甜點", "餅乾", "麥當勞", "肯德基", "摩斯", "頂呱呱", "星巴克", "coco", "清心",
        "飲料", "咖啡", "奶茶", "手搖", "果汁", "啤酒", "酒", "熱炒", "零食", "泡麵",
        "水果", "超市", "全聯", "家樂福", "美食"
    },
    "醫療": {
        "掛號", "醫院", "診所", "醫生", "藥局", "藥品", "感冒藥", "退燒藥", "醫療用品", "健康檢查", "體檢",
        "健保", "自費", "牙醫", "洗牙", "補牙", "拔牙", "眼科", "眼鏡", "驗光", "驗血", "皮膚科",
        "中醫", "針灸", "推拿", "物理治療", "心理諮商", "保健食品", "維他命", "營養品", "健身運動", "健身房", "運動", "瑜珈", "按摩"
    },
    "金融": {
        "提款", "存款", "轉帳", "匯款", "繳費", "信用卡", "儲值", "股票", "基金", "投資", "保險", "分期", "刷卡", "利息", "貸款", "現金", "匯率", "虛擬貨幣", "ATM", "手續費"
    },
    "稅金": {
        "所得稅", "營業稅", "房屋稅", "地價稅", "車輛稅", "牌照稅", "健保費", "勞保費", "保費", "稅金", "稅", "繳稅"
    },
    "其他": {
        "捐款", "紅包", "禮金", "禮物", "罰單", "獎金", "遺失", "其他", "雜支", "善款", "慰問金", "退費", "補貼", "補助"
    },
    "電信": {
        "電信", "電話費", "行動網路", "手機費", "4G", "5G", "網路費", "WiFi", "寬頻", "中華電信", "台灣大哥大", "遠傳", "亞太", "台灣之星", "MOD", "光世代", "固網"
    },
    "住家": {
        "水費", "電費", "瓦斯", "管理費", "房貸", "房租", "押金", "仲介費", "搬家", "修繕", "維修", "家具", "傢俱", "家電",
        "清潔", "洗衣費", "居家服務", "日常用品", "衛生紙", "清潔劑", "垃圾袋", "瓦斯費", "租金", "水電", "地產", "社區", "電梯費"
    },
    "交通": {
        "捷運", "火車", "台鐵", "高鐵", "公車", "客運", "計程車", "計程車費", "uber", "Lyft", "租車", "油錢", "停車費", "停車", "ETC", "加油", "車票", "機車", "汽車", "YouBike", "飛機", "機票", "交通"
    },
    "學習": {
        "線上課程", "課程", "補習", "學費", "上課", "教材", "書籍", "考試", "證照", "報名費", "參展", "研討會", "講座", "學雜費", "訓練", "語言", "英文", "TOEIC", "多益"
    }
}


# 依你的 config 修改
client = MongoClient(MONGO_URI)
db = client[DB_NAME]

for name, keywords in category_keywords.items():
    db.categories.update_one(
        {"name": name},
        {"$set": {
            "keywords": list(keywords),
            "desc": "",
        }},
        upsert=True
    )

print("初始化主類別寫入完成！")
